#include <stdio.h>                                           //การนำเข้าไลบรารีสำหรับการใช้งานฟังก์ชัน printf
void countCall(){                                            // ฟังก์ชันที่ใช้ในการนับจำนวนครั้งที่ถูกเรียก
    static int counter = 0;                                  // ประกาศตัวแปร counter ในระดับ static เพื่อเก็บค่าระหว่างการเรียกใช้ฟังก์ชัน
    counter++;                                               // เพิ่มค่า counter ทุกครั้งที่ฟังก์ชันถูกเรียก
    printf("Call Function: Counter = %d\n", counter);        // แสดงค่าของ counter

}

int main() {                                                // ฟังก์ชันหลักของโปรแกรม
    printf("Starting function calls...\n");                 // แสดงข้อความเริ่มต้น
    countCall();                                            // เรียกใช้ฟังก์ชัน countCall ครั้งแรก
    printf("After first call:\n");                          // แสดงข้อความหลังจากเรียกใช้ฟังก์ชันครั้งแรก
    countCall();                                            // เรียกใช้ฟังก์ชัน countCall ครั้งที่สอง
    return 0;                                               // ส่งค่ากลับ 0 เพื่อบ่งบอกว่าการทำงานสำเร็จ
}

//ผลลัพธ์ที่ได้ถ้าเป็น static int เมื่อเรียกใช้ฟังก์ชัน countCall() จะทำให้ตัวแปร counter เก็บค่าจำนวนครั้งที่ถูกเรียกใช้
//และไม่ถูกรีเซ็ตทุกครั้งที่ฟังก์ชันถูกเรียก ทำให้ผลลัพธ์แสดงจำนวนครั้งที่ถูกเรียกใช้สะสม

 