#include <stdio.h>

int main() {
    int score = 90.5;
    printf("score = %d\n", score);
   
    float fscore = 90.5;
    printf("score = %.1f\n", fscore);
    return 0;
}

//คำถามท้ายโจทย์

//1. ผลลัพธ์ที่ได้ต่างกันอย่างไร?
// เมื่อได้ทำการลองใช้ตัวแปร score เป็น int และ float จะพบว่า
// การใช้ int จะทำให้ค่าทศนิยมถูกตัดออกไป ทำให้ผลลัพธ์ที่ได้เป็น 90
// ส่วนการใช้ float จะทำให้ค่าทศนิยมถูกเก็บไว้และแสดงผลลัพธ์เป็น 90.5

//2. ทำไมต้องเลือก Data Type ให้ถูกต้อง?
// เพื่อให้โปรแกรมทำงานได้อย่างถูกต้องและมีประสิทธิภาพ และมีความแม่นยยำในการคำนวณ

//3. อภิปราย และสรุปผลที่ได้จากการทดลอง
// เมื่อใช้ Data Type ที่ไม่เหมาะสมกับค่าที่ต้องการเก็บ จะทำให้ข้อมูลสูญหายหรือไม่ถูกต้อง
// การเลือก Data Type ที่เหมาะสมจึงเป็นสิ่งสำคัญในการเขียนโปรแกรม
// การใช้ int กับ float มีความแตกต่างกันในการจัดเก็บค่าทศนิยม
