#include <stdio.h>               // นำเข้าไลบรารีสำหรับการใช้งานฟังก์ชัน printf 

int main() {                     // เริ่มต้นโปรแกรมหลัก  (Keyword) 
    char x [] = "Hello";         // ประกาศตัวแปร x เป็นอาร์เรย์ของตัวอักษรและกำหนดค่าเป็น "Hello" (Identifier)
    char y [] = "C Tokens!";     // ประกาศตัวแปร y เป็นอาร์เรย์ของตัวอักษรและกำหนดค่าเป็น "C Tokens!" (Identifier)
    
    printf("%s\n", x);           // แสดงข้อความ "Hello" และขึ้นบรรทัดใหม่    
    printf("%s", y);             // แสดงข้อความ "C Tokens!" โดยไม่ขึ้นบรรทัดใหม่  
   
    return 0;                    //จบโปรแกรมหลักและส่งค่ากลับ 0
}